# `brew tap`
# tap "homebrew/cask"
tap "homebrew/bundle"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"

brew "mas" # mac app store


# shell
cask "iterm2" # iTerm2 terminal
brew "fish" # fish shell
brew "starship" # shell prompt

# Fonts
cask "font-fira-code-nerd-font" 
cask "font-0xproto-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-anonymice-powerline"
cask "font-fira-mono-nerd-font"
cask "font-fira-mono-for-powerline"
cask "homebrew/cask-fonts/font-hack-nerd-font"

# shell tools
brew "neovim" # NeoVim editor
brew "fping" # ping replacement
brew "procs" # ps replacement
brew "bat" # cat replacement
brew "fzf" # file fuzzy-finder
brew "difftastic" # better diff
# brew "dog" # DNS client deprecated upstream
brew "duti" # usefull to change default extension handler app
# brew "fs" # better find
brew "git"
brew "git-delta" # better diff
brew "gping" # petter ping
brew "hexyl" # Hex viewer
brew "jq" # tool for manipulating JSON
brew "htmlq" # tool for manipulating HTML
brew "sqlite-utils" # tools for sqlite
brew "htop"
brew "httpie"
brew "lynis" # security audit tool
brew "minisign" # file signing utility
brew "noti" # monitor and notify
brew "oha" # simple load tester
brew "ollama" # LLM
brew "pgcli" # postgres client
brew "ripgrep" # find in files
brew "tealdeer" # documentations TLDR-like
brew "viddy" # modern watch
brew "xsv" # CSV manipulation
brew "yank" # terminal output to clipboard
brew "ykman" # yubikey manager
brew "zoxide" # smart cd
brew "atuin" # shell history
brew "lazygit" # simple git client

# Safari extensions
mas "1Password for Safari", id: 1569813296 # 1password for safari extension
mas "com.kagimacOS.Kagi-Search", id: 1622835804 # Kagi search
mas "Vinegar", id: 1591303229 # Adds native video control to web videos
mas "Tampermonkey", id: 1482490089 # to change certain webpages behavior
mas "StopTheMadness Pro", id: 6471380298 # remove unwanted websites behaviors

# Applications
cask "netnewswire" # RSS reader
cask "1password" # Password manager
cask "typora" # Markdown editor
cask "obsidian" # thoughts organizer
cask "rectangle" # window manager
cask "raycast" # Launcher
cask "iina" # media player
cask "muzzle" # remove notification when casting
cask "numi" # calculator
cask "pika" # color picker

# cask "rapidapi" # API tool
# cask "orbstack" # docker manager
# cask "path-finder" # nc file manager
# cask "pixelsnap" # mesure pixels


mas "Tailscale", id: 1475387142 # VPN
cask "utm" # Qemu virtualiser

mas "Microsoft Excel", id: 462058435 # MSFT Excel
mas "Microsoft Word", id: 462054704 # MSFT Word
mas "Numbers", id: 409203825 # AAPL Numbers
mas "Pages", id: 409201541 # AAPL Pages

mas "Slack", id: 803453959 # Slack client
mas "‎WhatsApp", id: 310633997 # Whatsapp
cask "signal" # Signal Messaging

cask "visual-studio-code"

